# Задача №2
# 
#   Шаховий кінь ходить літерою «Г» - на дві клітини по вертикалі
#   в будь-якому напрямку і на одну клітинку по горизонталі, або навпаки.
#   Дано дві різні клітинки шахової дошки, визначте, чи може кінь потрапити
#   з першої клітинки на другу за один хід. Програма отримує на вхід чотири 
#   числа від 1 до 8 кожне, що задають номер стовпця і номер рядка спочатку
#   для першої клітинки, потім для другої клітинки. Програма повинна вивести
#   Yes, якщо з першої клітинки ходом коня можна потрапити в другу або No в іншому випадку.
# 
# Дзюба Владислав

x1 = int(input("Введіть стовпець першої клітинки (1-8): "))

y1 = int(input("Введіть рядок першої клітинки (1-8): "))

x2 = int(input("Введіть стовпець другої клітинки (1-8): "))

y2 = int(input("Введіть рядок другої клітинки (1-8): "))

dx = x1 - x2 if x1 > x2 else x2 - x1
dy = y1 - y2 if y1 > y2 else y2 - y1

if (dx == 1 and dy == 2) or (dx == 2 and dy == 1):
    print("Yes")
else:
    print("No")
